geobee-backend/app/controllers/scores_controller.rb

    def index
        scores = Score.all
---
SELECT "scores".* FROM "scores"

    def create
        render json: Score.create(score_params)
---
INSERT INTO "scores" ("total", "user_id", "states_game_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["total", 4], ["user_id", 11], ["states_game_id", 62], ["created_at", "2021-01-27 17:40:02.837274"], ["updated_at", "2021-01-27 17:40:02.837274"]]