geobee-backend/app/controllers/states_games_controller.rb

SELECT "states_games".* FROM "states_games"
---
    def index
        states_games = StatesGame.all

INSERT INTO "states_games" ("difficulty", "created_at", "updated_at") VALUES (?, ?, ?)  [["difficulty", "Easy"], ["created_at", "2021-01-26 22:50:35.967951"], ["updated_at", "2021-01-26 22:50:35.967951"]]
---
    def create
        render json: StatesGame.create(difficulty: states_games_params["difficulty"])