app/controllers/users_controller.rb

    def show
        user = User.find(params['id'])
        user_games = user.states_games
        result = user_games.map {|i| {i.difficulty => i.scores[0]}}
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
SELECT "states_games".* FROM "states_games" ORDER BY "states_games"."id" DESC LIMIT ?  [["LIMIT", 1]]
SELECT "scores".* FROM "scores" WHERE "scores"."states_game_id" = ?  [["states_game_id", 61]]

    def create
        user = User.find_or_create_by(username: user_params["username"])
---
INSERT INTO "users" ("username", "created_at", "updated_at") VALUES (?, ?, ?)  [["username", "jim"], ["created_at", "2021-01-28 01:20:33.154715"], ["updated_at", "2021-01-28 01:20:33.154715"]]
SELECT "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "rachel"], ["LIMIT", 1]]